In [8]:
import pandas as pd
import os


from sqlalchemy import create_engine

In [9]:
pwd = os.environ['PGPWD']
connect_string = f'postgresql://postgres:{pwd}@localhost:5432/HRdb'

In [10]:
engine = create_engine(connect_string)
connection = engine.connect()

In [20]:
df_employees = pd.read_sql_query('select * from employees',con=connection)
df_employees.head()

df_titles = pd.read_sql_query('select * from emp_titles',con=connection)
df_titles.head()

df_titles_rnk = pd.read_sql_query('select emp_no, title, rank() over (PARTITION BY emp_no ORDER BY to_date DESC) as RNK from emp_titles',con=connection)
df_titles_rnk.head()

df_titles_curr = df_titles_rnk.loc[df_titles_rnk['rnk']==1]
df_titles_curr.head()

   emp_no            title  rnk
0   10001  Senior Engineer    1
1   10002            Staff    1
2   10003  Senior Engineer    1
3   10004  Senior Engineer    1
5   10005     Senior Staff    1

In [22]:
df_emp_titles = pd.merge(df_employees, df_titles_curr, on='emp_no')
df_emp_titles.head()

df_emp_sal = pd.read_sql_query('select * from salaries', con=connection)


df_emp_titles_sal = pd.merge(df_emp_titles, df_emp_sal, on='emp_no')


df_emp_titles_sal.head()

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,rnk,salary,from_date,to_date
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,Senior Engineer,1,60117,1986-06-26,1987-06-26
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,Staff,1,65828,1996-08-03,1997-08-03
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,Senior Engineer,1,40006,1995-12-03,1996-12-02
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Senior Engineer,1,40054,1986-12-01,1987-12-01
4,10005,1955-01-21,Kyoichi,Maliniak,M,1989-09-12,Senior Staff,1,78228,1989-09-12,1990-09-12

In [29]:
df_title_grp = df_emp_titles_sal.groupby(['title'])['salary'].mean()

df_title_grp.head()

title
Assistant Engineer    48564.434447
Engineer              48535.144165
Manager               49600.555556
Senior Engineer       48506.799871
Senior Staff          58503.993042
Name: salary, dtype: float64